### 12 feature extraction

In [2]:
import pandas as pd
data_dict = {
    'currency': [['PLN','USD'],
                 ['EUR','USD','PLN','CAD'],
                 ['GBP'],
                 ['JPY','CZK','HUF'],
                 []]
}
df = pd.DataFrame(data_dict)
df

               currency
0            [PLN, USD]
1  [EUR, USD, PLN, CAD]
2                 [GBP]
3       [JPY, CZK, HUF]
4                    []

In [3]:
df['number'] = df['currency'].map(len)
df

               currency  number
0            [PLN, USD]       2
1  [EUR, USD, PLN, CAD]       4
2                 [GBP]       1
3       [JPY, CZK, HUF]       3
4                    []       0

### 13 add "if contain" col

In [4]:
df['USD_flag'] = df['currency'].map(lambda x:1 if 'USD' in x else 0)
df

               currency  number  USD_flag
0            [PLN, USD]       2         1
1  [EUR, USD, PLN, CAD]       4         1
2                 [GBP]       1         0
3       [JPY, CZK, HUF]       3         0
4                    []       0         0

### 14 extract tag from string

In [5]:
df = pd.DataFrame({'tags':['#good#vibes','#hot#summer#holiday','#street#food','#workout']})
df

                  tags
0          #good#vibes
1  #hot#summer#holiday
2         #street#food
3             #workout

In [6]:
df = df['tags'].str.split('#', expand=True)
df

  0        1       2        3
0       good   vibes     None
1        hot  summer  holiday
2     street    food     None
3    workout    None     None

In [7]:
df.drop(columns=[0], inplace=True)
df.columns=['tag1','tag2','tag3']
df

      tag1    tag2     tag3
0     good   vibes     None
1      hot  summer  holiday
2   street    food     None
3  workout    None     None

### 15 count missing value in each line

In [9]:
df['missing'] = df.isnull().sum(axis=1)
df

      tag1    tag2     tag3  missing
0     good   vibes     None        1
1      hot  summer  holiday        0
2   street    food     None        1
3  workout    None     None        2

### 16 extract number

In [10]:
df = pd.DataFrame({'investments':['100_000_000','100_000','30_000_000','100_500_000']})
df

   investments
0  100_000_000
1      100_000
2   30_000_000
3  100_500_000

In [11]:
df['investments'] = df['investments'].str.replace('_','').astype(int)
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   investments  4 non-null      int64
dtypes: int64(1)
memory usage: 160.0 bytes

   investments
0    100000000
1       100000
2     30000000
3    100500000